import React from 'react';
import './index.css';
import Form from '../Form/Form';

function Journal() {
    return(
        <div className="book">
                            <div className="left">
                                <h3>Дата\время</h3>
                                <ul className='left__tabel'>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <Form/>
                                </ul>
                            </div>
                            {/* <hr className="poloska"></hr> */}
                            <div className="center">
                                <h3>Название</h3>
                                <ul className="center__table">
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                </ul>
                            </div>
                            <div className="right">
                                <h3>Сообщение</h3>
                                <ul className="right__table">
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                </ul>
                            </div>
                        </div>
    );
}

export default Journal;