import React from "react";
import './index.css';

export default class Background extends React.Component{
    render(){
        return(
            <body>
                <div className="page">
                        <div className="header">
                            <h1 className="logo">IntegrityWebManager</h1>
                            <h2 className="title">Журнал</h2>
                            <div></div>
                        </div>
                        <div className="logbook">
                            <div className="left">
                                <h3>Дата\время</h3>
                                <ul className='left__tabel'>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                    <p>04 июн 15:28:05</p>
                                </ul>
                            </div>
                            {/* <hr className="poloska"></hr> */}
                            <div className="center">
                                <h3>Название</h3>
                                <ul className="center__table">
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                   <p>Полное название данной компоненты</p>
                                </ul>
                            </div>
                            <div className="right">
                                <h3>Сообщение</h3>
                                <ul className="right__table">
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                    <p>Это сообщение, которое относится к компоненте, ошибка или предупреждение</p>
                                </ul>
                            </div>
                        </div>
                </div>
            </body>
        );
    }
}
